In [ ]:
# File Creating
s=""
n=int(input("Enter n ="))
file=open("data1.txt","a")
for i in range(n):
    name=(input("Enter name="))
    phone= int(input("Enter phone="))
    info= f"{name},{phone}\n"
    s=s+info
    
print(s)
file.write(s)
file.close()

In [17]:
import pandas as pd
df=pd.read_csv("data.csv",index_col="Sn")
df.tail(5)

      Name  Age     Address       Phone
Sn
2     Hari   20     Chitwan   984834783
3     Moon   22   Kathmandu   984356656
4    Milan   22  Biratnagar   980067565
5    Punam   21      Ithari  9867544524
6   Roshan   19      Butwal   987065457

In [23]:
import pandas as pd
df=pd.read_csv("data.csv",index_col="Sn",usecols = ["Sn","Name","Age"])
df.tail(5)

      Name  Age
Sn
2     Hari   20
3     Moon   22
4    Milan   22
5    Punam   21
6   Roshan   19

In [28]:
import pandas as pd
df=pd.read_csv("data.csv",index_col="Sn")
df.iloc[1:4,0:2]

     Name  Age
Sn
2    Hari   20
3    Moon   22
4   Milan   22

In [29]:
import pandas as pd
df=pd.read_csv("data.csv",index_col="Sn")
df.loc[1:4]

     Name  Age     Address       Phone
Sn
1     Ram   18     Pokhara  9836463974
2    Hari   20     Chitwan   984834783
3    Moon   22   Kathmandu   984356656
4   Milan   22  Biratnagar   980067565

In [38]:
import pandas as pd
df=pd.read_csv("data.csv",index_col="Sn")
df[df["Age"]>20]
df[df["Address"]=="Kathmandu"]

      Name  Age    Address      Phone
Sn
3     Moon   22  Kathmandu  984356656
6   Roshan   19  Kathmandu  987065457

In [1]:
import pandas as pd
df=pd.read_csv("data.csv",index_col="Sn")
data =df[df["Address"]=="Kathmandu"]
data.to_csv("new file.csv")

In [3]:
import pandas as pd
d={"Name":["Akash","Sabin","Sita"],"Age":[20,30,34]}
df = pd.DataFrame(d)
df.to_csv("info.csv")
df

    Name  Age
0  Akash   20
1  Sabin   30
2   Sita   34

In [4]:
import pandas as pd
d={"Name":["Akash","Sabin","Sita"],"Age":[20,30,34]}
df = pd.DataFrame(d)                                      #row & col
df.to_json("info.json")
df

    Name  Age
0  Akash   20
1  Sabin   30
2   Sita   34

In [5]:
import csv
fields=["kamal","28"]
f=open("info.csv","w")
x=csv.writer(f)
x.writerow(fields)
f.close()

In [15]:
import csv
data=[["Ram",67,"Kathmandu"],["Shyam",34,"Patan"],["Sita",23,"Bhaktapur"]] #row anusar
f=open("info.csv","w")
x=csv.writer(f)
for i in data:
    x.writerow(i)
f.close()

In [17]:
import csv
data=[]
with open("info.csv") as csvfile:
    reader=csv.DictReader(csvfile)
    for row in reader:
         data.append(dict(row))
print(data)

[{'Name': 'Ram', 'Age': '67', 'Address': 'Kathmandu'}, {'Name': 'Shyam', 'Age': '34', 'Address': 'Patan'}, {'Name': 'Sita', 'Age': '23', 'Address': 'Bhaktapur'}]

In [24]:
import csv
csv_columns=["Name","Age","Address"]
dict=[{'Name': 'Moon', 'Age': '67', 'Address': 'Kathmandu'},
      {'Name': 'Shyam', 'Age': '34', 'Address': 'Patan'}
]
csvfile=open("data.csv","w")
writer=csv.DictWriter(csvfile,fieldnames=csv_columns)
writer.writeheader()
for data in dict:
    writer.writerow(data)
csvfile.close()